[
  {
    "slug": "importance-of-blood-donation",
    "title": "The Importance of Regular Blood Donation",
    "image": "/Benefits of Donating Blood_ 1_A Longer Life….jpeg",
    "content": "Blood donation is one of the most impactful ways to save lives. Every time you donate, you provide hospitals and emergency services with a vital resource that cannot be artificially manufactured. Regular donations help ensure a constant supply for surgeries, cancer treatments, and accident victims. Besides the lifesaving impact, regular donors often experience a sense of purpose and community involvement. It's a simple act that takes less than an hour but could mean a lifetime for someone else.",
    "author": "Dr. Amina Yusuf",
    "date": "June 20, 2025",
    "category": "Health"
  },
  {
    "slug": "5-things-before-donating",
    "title": "5 Things to Know Before Donating Blood",
    "image": "/Blood & the Circulatory System Science Lesson.jpeg",
    "content": "Before your next donation, here are five tips to keep in mind: (1) Eat a healthy meal rich in iron; (2) Drink plenty of water before and after your donation; (3) Get a good night's sleep; (4) Avoid strenuous activity immediately after donating; (5) Bring a valid ID. These simple preparations can help prevent dizziness and make the process smoother. Always consult with the medical team if you have any questions before donating.",
    "author": "Tunde Adio",
    "date": "June 10, 2025",
    "category": "Tips"
  },
  {
    "slug": "blood-donation-facts",
    "title": "Blood Donation Facts You Might Not Know",
    "image": "/We appreciate your spirit in donating blood during….jpeg",
    "content": "One pint of blood can save up to three lives. That’s because blood is separated into red cells, plasma, and platelets—each used for different medical needs. Most people have about 10 pints of blood, and the average donation is just one pint. Blood has a short shelf life, making frequent donations essential. Surprisingly, less than 10% of eligible donors actually give blood annually. Your contribution truly makes a difference.",
    "author": "Ngozi Okonjo",
    "date": "June 5, 2025",
    "category": "Facts"
  },
  {
    "slug": "how-to-prepare-for-donation",
    "title": "How to Prepare for Your First Blood Donation",
    "image": "/Keolis MHI Champions Life-Saving Blood Drive in Support of World Blood Donor Day.jpeg",
    "content": "Preparing well can make your donation smoother and more enjoyable. Start by hydrating throughout the day before your donation. Eat a light meal, especially foods rich in iron. Avoid alcohol and heavy exercise right before your appointment. Wearing loose clothing and bringing a book or music can help you relax. Remember to communicate any health concerns with the staff—they are there to support you.",
    "author": "Sarah James",
    "date": "May 30, 2025",
    "category": "Tips"
  },
  {
    "slug": "benefits-for-donors",
    "title": "Health Benefits of Being a Blood Donor",
    "image": "/portrait-female-smiling-after-getting-vaccine-woman-holding-down-her-shirt-sleeve-showing-her-arm-with-bandage-after-receiving-vaccination.jpg",
    "content": "Donors may enjoy improved cardiovascular health, lower iron levels, and a reduced risk of heart disease through regular donations. The process can also help reduce harmful iron stores and may even offer insights into your general health through the mini-physical done before donation. Many donors also report emotional benefits—knowing their actions contribute directly to saving lives brings a deep sense of satisfaction.",
    "author": "Dr. Kelechi Obi",
    "date": "May 24, 2025",
    "category": "Health"
  },
  {
    "slug": "blood-types-explained",
    "title": "Understanding Blood Types and Compatibility",
    "image": "/Переливание крови.jpeg",
    "content": "Learn what makes O-negative the universal donor and why AB-positive individuals are universal plasma recipients. Blood types are determined by the presence or absence of certain antigens and antibodies. Compatibility is crucial for safe transfusions, especially during emergencies. Understanding these basics helps donors appreciate their unique contribution, especially those with rarer blood types. Every type matters.",
    "author": "Funmi Adebayo",
    "date": "May 18, 2025",
    "category": "Facts"
  },
  {
    "slug": "who-can-donate",
    "title": "Who Can Donate Blood and How Often?",
    "image": "/5 Things To Avoid When Donating Blood - Shabby Chic Boho.jpeg",
    "content": "Are you eligible to donate? Healthy adults aged 18–65 (varies by country) can usually donate, depending on their weight, hemoglobin levels, and overall health. Whole blood can be donated every 8 weeks, while platelets can be given more frequently. There are temporary deferrals for travel, illness, and medications, so always check with donation centers. Even if you can’t donate today, there may be other ways to help.",
    "author": "Zainab Musa",
    "date": "May 12, 2025",
    "category": "Tips"
  },
  {
    "slug": "blood-bank-process",
    "title": "What Happens to Your Blood After Donation?",
    "image": "/Blood Culture Collection Steps _ Blood Collection (Rx-TN).jpeg",
    "content": "Your blood goes through a careful processing and testing journey. First, it’s separated into components—red cells, plasma, and platelets. Each component is tested for infections like HIV and hepatitis. Once cleared, the components are stored and shipped to hospitals where they’re matched with patients. This journey ensures safety, transparency, and timely delivery to those in critical need.",
    "author": "Chinedu Nwachukwu",
    "date": "May 6, 2025",
    "category": "Facts"
  },
  {
    "slug": "common-myths-busted",
    "title": "10 Common Blood Donation Myths Busted",
    "image": "/Participate in blood donation and save lives together!.jpeg",
    "content": "Think you can't donate because you're underweight? Think again. Many people disqualify themselves based on misconceptions. Donating doesn't make you weak, you won't get infected, and it's perfectly safe. Even vegetarians can donate. And yes, you can donate even with tattoos if they were done in a licensed facility. Let’s bust the myths and get more people donating with confidence.",
    "author": "Esther Kolade",
    "date": "April 29, 2025",
    "category": "Facts"
  },
  {
    "slug": "donor-stories",
    "title": "Stories From Our Regular Donors",
    "image": "/Ghanaians Donate Over 6,000 Units Of Blood At MTN Foundation ‘Save A Life’ Campaign On Valentine’s Day.jpeg",
    "content": "Real experiences that show the joy of giving. From first-time donors to those who’ve given over 50 times, the stories are inspiring. Many share how they started during emergencies or after losing someone and now donate regularly. These stories highlight the humanity, compassion, and selflessness at the heart of blood donation. Every donor has a story worth sharing.",
    "author": "Michael Abayomi",
    "date": "April 22, 2025",
    "category": "Health"
  },
  {
    "slug": "mobile-blood-drives",
    "title": "How Mobile Blood Drives Work",
    "image": "/We appreciate your spirit in donating blood during….jpeg",
    "content": "Mobile units are bringing donation opportunities to you—whether it's in schools, offices, or community centers. These buses are fully equipped for safe collection and staffed by trained professionals. Mobile drives remove the barrier of location and reach more potential donors. Participating is just as safe and impactful as visiting a fixed center. Look out for upcoming drives near you!",
    "author": "Blessing Chukwu",
    "date": "April 16, 2025",
    "category": "Health"
  },
  {
    "slug": "donor-eligibility-faqs",
    "title": "Top FAQs About Donor Eligibility",
    "image": "/FAQs stock photo_ Image of letters, communication, helpful - 87514504.jpeg",
    "content": "Have a question about eligibility? We’ve got answers. Can I donate if I have a cold? Not today, but come back after you’re well. What if I’ve traveled recently? It depends on where. Each question about health, medications, and lifestyle matters to ensure safety for both the donor and recipient. This FAQ clears up the most common concerns so you can donate with peace of mind.",
    "author": "Daniel Ekpo",
    "date": "April 10, 2025",
    "category": "Tips"
  },
  {
    "slug": "first-donation-tips",
    "title": "What to Expect on Your First Blood Donation",
    "image": "/3f679e32-d643-4eda-a4ce-83de774f81b9.jpeg",
    "content": "Nervous? Here’s a guide to calm your mind. You’ll be greeted, fill out a health questionnaire, and undergo a quick physical check. The actual donation takes less than 15 minutes. Afterward, you’ll rest and enjoy a light snack. Most people feel just fine and go about their day. Knowing what to expect helps reduce anxiety and encourages more people to donate.",
    "author": "Lilian Odey",
    "date": "April 3, 2025",
    "category": "Tips"
  },
  {
    "slug": "urgent-need-rare-types",
    "title": "Why Rare Blood Types Are Always Needed",
    "image": "/A tipping point for developing high blood pressure_ - Harvard Health.jpeg",
    "content": "AB-negative and other rare types save critical lives. Since they’re less common, hospitals often face shortages. Patients with rare types can only receive compatible blood, making regular donations from these donors essential. If you have a rare type, consider becoming a committed donor. You might be the only match available for someone in an emergency.",
    "author": "Uche Agwu",
    "date": "March 28, 2025",
    "category": "Facts"
  },
  {
    "slug": "volunteer-opportunities",
    "title": "Volunteer Opportunities with ALIFE",
    "image": "/woman-showing-sticker-arm-after-getting-vaccine.jpg",
    "content": "You don’t have to donate blood to make an impact. ALIFE offers volunteer opportunities in organizing drives, registering donors, spreading awareness, and more. Volunteers play a crucial role in making donation events successful and engaging communities. Whether you're a student, health worker, or just passionate about helping, there’s a way to get involved.",
    "author": "Ifeanyi Ojo",
    "date": "March 21, 2025",
    "category": "Health"
  }
]
